app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "ncathie2020@gmail.com"], ["updated_at", "2020-06-25 19:54:53.468625"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)